InformationRegisters/ОдноразовыеПароли.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ОдноразовыеПароли</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ОдноразовыйПароль</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ФормаРегистрацииМобильногоАгента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница1;
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Процедура СледующийШаг(Команда)
	
	Если НЕ ЗначениеЗаполнено(МобильныйАгент) Тогда
		Сообщение = Новый СообщениеПользователю;
		Текст = НСтр( "ru = 'Укажите владельца мобильного устройства.'; uk = 'Вкажіть власника мобiльного пристрою.'");
		Сообщение.Текст = Текст;
		Сообщение.Поле = "МобильныйАгент";
		Сообщение.Сообщить(); 
		Возврат;
	КонецЕсли;
	
	Если ПроверитьАктуальныеУстройстваФизЛица(МобильныйАгент) Тогда
		СписокКнопок = Новый СписокЗначений;
		СписокКнопок.Добавить("Архивировать и продолжить");
		СписокКнопок.Добавить("Отмена");
		Ответ = Вопрос("Для этого человека уже зарегистрировано мобильное устройство. Для регистрации нового необходимо архивировать старое устройство. Что вы хотите сделать?", СписокКнопок);
		Если Ответ = "Архивировать и продолжить" Тогда
			Попытка
				ОбменДаннымиМобПриложениеСервер.АрхивироватьАктуальныеУстройстваФизЛица(МобильныйАгент);
			Исключение
				Сообщить("Не удалось заархивировать старое устройство по следующей причине: " + КраткоеПредставлениеОшибки(ОписаниеОшибки()));
				Возврат;
			КонецПопытки;
		Иначе
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	СледующийШагНаСервере();
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница2;
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервере
Процедура СледующийШагНаСервере()
	
	ОдноразовыйПароль = 0;
	СрокДействия = Дата("00010101");
	
	// Для начала проверим, а нет ли у этого пользователя действующих паролей
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОдноразовыеПароли.ОдноразовыйПароль,
		|	ОдноразовыеПароли.СрокДействия
		|ИЗ
		|	РегистрСведений.ОдноразовыеПароли КАК ОдноразовыеПароли
		|ГДЕ
		|	ОдноразовыеПароли.ФизическоеЛицо = &ФизическоеЛицо";

	Запрос.УстановитьПараметр("ФизическоеЛицо", МобильныйАгент);
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл
		Если Выборка.СрокДействия < ТекущаяДата() Тогда
			// Пароль недействителен, его можно удалять
			Менеджер = РегистрыСведений.ОдноразовыеПароли.СоздатьМенеджерЗаписи();
			Менеджер.ФизическоеЛицо = МобильныйАгент;
			Менеджер.ОдноразовыйПароль = Выборка.ОдноразовыйПароль;
			Менеджер.Прочитать();
			Менеджер.Удалить();
		Иначе
			ОдноразовыйПароль = Выборка.ОдноразовыйПароль;
			СрокДействия = Выборка.СрокДействия;
		КонецЕсли;
	КонецЦикла;
	
	Если ОдноразовыйПароль = 0 Тогда
		// Сгенерируем новый пароль
		ГСЧ = Новый ГенераторСлучайныхЧисел;
		ОдноразовыйПароль = ГСЧ.СлучайноеЧисло(100000, 999999);
		Пока ПроверитьСуществованиеПароляВБазе(ОдноразовыйПароль) Цикл
			ОдноразовыйПароль = ГСЧ.СлучайноеЧисло(100000, 999999);
		КонецЦикла;
		
		Набор = РегистрыСведений.ОдноразовыеПароли.СоздатьНаборЗаписей();
		Набор.Отбор.ОдноразовыйПароль.Установить(ОдноразовыйПароль);
		Запись 						= Набор.Добавить();
		Запись.ФизическоеЛицо 		= МобильныйАгент;
		Запись.ОдноразовыйПароль 	= ОдноразовыйПароль;
		Запись.СрокДействия			= КонецМинуты(ТекущаяДата() + 60 * 60); // + 1 час
		Набор.Записать();
		
		СрокДействия = Запись.СрокДействия;
		Элементы.НадписьПароль.Заголовок = "Введите этот пароль на мобильном устройстве:";
	Иначе
		Элементы.НадписьПароль.Заголовок = "Для этого человека уже был сгенерирован следующий код:";
	КонецЕсли;
	
	Элементы.СрокДействия.Заголовок = СтрЗаменить(Элементы.СрокДействия.Заголовок, "¤1¤", Формат(СрокДействия, "ДФ=ЧЧ:мм"));
	
	
КонецПроцедуры // НазначитьМобильногоАгента()

&НаСервереБезКонтекста
Функция ПроверитьАктуальныеУстройстваФизЛица(ФизЛицо)
	
	Возврат ОбменДаннымиМобПриложениеСервер.ПолучитьАктуальныеУстройстваФизЛица(ФизЛицо).Количество() <> 0;
	
КонецФункции

// Возвращает Истина, если такой пароль уже назначен другому устройству
&НаСервереБезКонтекста
Функция ПроверитьСуществованиеПароляВБазе(Пароль)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	1 КАК Поле1
		|ИЗ
		|	РегистрСведений.ОдноразовыеПароли КАК ОдноразовыеПароли
		|ГДЕ
		|	ОдноразовыеПароли.ОдноразовыйПароль = &Пароль";

	Запрос.УстановитьПараметр("Пароль", Пароль);

	Возврат НЕ Запрос.Выполнить().Пустой();
	
КонецФункции

&НаКлиенте
Процедура АннулироватьПароль(Команда)
	
	АннулироватьПарольНаСервере(ОдноразовыйПароль);
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница1;
	УстановитьВидимость();
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура АннулироватьПарольНаСервере(ОдноразовыйПароль)
	
	Набор = РегистрыСведений.ОдноразовыеПароли.СоздатьНаборЗаписей();
	Набор.Отбор.ОдноразовыйПароль.Установить(ОдноразовыйПароль);
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимость()
	
	ЭтоСтраница1 = Элементы.Страницы.ТекущаяСтраница = Элементы.Страница1;
	
	Элементы.СледующийШаг.Видимость = ЭтоСтраница1;
	Элементы.ЗарегистрироватьЕщеУстройство.Видимость = НЕ ЭтоСтраница1;
	Элементы.АннулироватьПароль.Видимость = НЕ ЭтоСтраница1;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗарегистрироватьЕщеУстройство(Команда)
	
	МобильныйАгент = ПредопределенноеЗначение("Справочник.ФизическиеЛица.ПустаяСсылка");
	ОдноразовыйПароль = 0;
	
	Элементы.Страницы.ТекущаяСтраница = Элементы.Страница1;
	УстановитьВидимость();
	
КонецПроцедуры
